function quotes() {
  let myQuotes = [
    `सपने और लक्ष्य में एक ही अंतर है
    सपने के लिए बिना मेहनत की नींद चाहिए
    और लक्ष्य के लिए बिना नींद की मेहनत`,
    `ना थके कभी पैर ना कभी हिम्मत हारी है
हौंसला है ज़िन्दगी में कुछ कर दिखाने का
इसलिए अभी भी सफर जारी है`,
    ` बूझी शमां भी जल सकती है, तूफ़ान से कश्ती भी निकल सकती है, होके मायूस यूँ ना अपने इरादे बदल, तेरी किस्मत कभी भी बदल सकती है.`,
    `जो मुस्कुरा रहा है उसे दर्द ने पाला होगा, जो चल रहा है उसके पाँव में छाला होगा, बिना संघर्ष के इन्सान चमक नही सकता, जो जलेगा उसी दिये में तो उजाला होगा`,
    `जिस नज़र से आप इस दुनिया को देखेंगे, ये दुनिया आपको वैसी ही दिखेगी।`,
    ` वही सफल होता है
जिसका काम उसे निरंतर आनंद देता है`,
    `चार दिन की दुनिया है फिर हिसाब होगा
आज गरीबी में जी ले मेरे दोस्त
कल बादशाहों में अपना नाम होगा
`,
    `
जो खैरात में मिलती कामयाबी तो हर शख्स कामयाब होता, फिर कदर न होती किसी हुनर की और न ही कोई शख्स लाजवाब होता।`,
    ` अगर अपनी औकात देखनी है
तो बाप के पैसों का इस्तेमाल करना छोड़ दो `,

    ` अगर अपनी औकात देखनी है
तो बाप के पैसों का इस्तेमाल करना छोड़ दो `,
    ` आप जितना कम बोलेंगे
इस दुनिया मे आपकी उतनी ज्यादा सुनी जाएगी`,
    `
कैसे हार जाऊं मैं इन तकलीफों के सामने
मेरी माँ तरक्की की आस में कब से बैठी है`,
    ` जो आपके साथ दिल से बात करता हो
उसको कभी दिमाग से जवाब मत देना `,

    `
मेहनत करने से दिमाक
और सच बोलने से दिल साफ रहता है `,
    `
जब भी MOTIVATION कम होने लगे
अपने माँ-बाप की तरफ देखकर पढ़ना शुरू करदे `,
    ` 25 की उम्र में लोग शादी करके अपने बच्चों के बारे में सोचते है
और मुझे मेरी माँ को AUDI के आगे वाली सीट पर बैठाना है `,
    ` मुश्किलें जरूर है मगर ठहरा नही हूँ मैं
मंजिलों से कह दो अभी पहुंचा नही हूँ मैं `,
    `राह संघर्ष की जो चलता है वहीं संसार को बदलता है जिसने रातों में जंग जीती है सूर्य बनकर वही निकलता है`,
    `इंसान कहता है अगर पैसा हो तो मैं कुछ करके दिखाऊ और पैसा कहता है कुछ करके दिखाओ तो मैं आऊ`,
    `मैं तुरंत नहीं लेकिन निश्चित तौर पर जीतूँगा`,
    `विनर और कोई नहीं होता है वह
वही लूजर होता है जो हारने के
खद एक बार और प्रयास करता है।`,
    `
तुमने खुद को कमजोर मान रखा है,
वरना तुम जो कर सकते हो वो कोई दूसरा नही कर सकता।`,
    `किस्मत के दरवाजे पर सर पीटने से
बेहतर है, अपने कर्मों के तूफान पैदा
करें, दरवाजे अपने आप खुल जायेंगे।`,
    `आंखों, में
नींद बहुत है पर सोना नहीं है,
यही समय है कुछ करने का इसे
खोना नहीं है।
`,
    `अगर मेहनत आदत बन जाए
तो कामयाबी 'मुकद्दर' बन जाती है।`,
    `आज रांस्ता बना लिया है,
तो कल मंजिल भी मिल जाएगी ॥
हौसलों से भरी यह कोशिश एक दिन
जरूर रंग लाएगी !!`,
    `हमेशा याद रखना, अच्छे दिनों के लिए,
बुरे दिनों से लड़ना पड़ता है।`,
    `
अगर जिंदगी में सुकून चाहते हो तो
Focus अपने काम पर करो लोगों की
बातो पर नहीं..`,
    `
जो मेहनत पे भरोसा करते हैं
वो किस्मत की बात कभी नही करते`,
    `अगर आपको कुछ बड़ा करना है,
तो बड़े लोगो की तरह सोचो।
`,
    `
जो.
व्यक्ति खुद को control
कर सकता है वो जिंदगी में कुछ
भी कर सकता है।`,
    `
हमेशा अपना बेस्ट करो जो तुम अभी बोते हो उसकी फसल बाद में काटते हो`,
    `आपका का आने वाला कल कैसा होगा यह इस बात पर निर्भर करता है कि आप आज अपने बारे में क्या सोचते है`,
    `मेहनत इतनी खामोशी से करो की  कामयाबी

शोर मचा दे`,
    `
समय सीमित है इसलिए इसे किसी और की

जिंदगी जी कर व्यर्थ मत करो`,
  ];

  let h2 = document.querySelector(".q");
  h2.textContent = myQuotes[Math.floor(Math.random() * myQuotes.length)];
}


window.addEventListener('load',quotes);
setInterval(quotes, 30 * 1000);

// Time
function clock() {
  const h1 = document.querySelector("h1");
  const clock = new Date();
  let hour = clock.getHours();
  let minute = clock.getMinutes();
  if (minute < 10) {
    minute = `0${minute}`;
  }
  if (hour < 10) {
    hour = `0${hour}`;
  }
  h1.textContent = ` ${hour}:${minute} `;
}

setInterval(clock, 1000);

// greeting user
function greet() {
  const USERNAME = "Bro";
  const h2 = document.querySelector(".greet");

  let date = new Date();
  let hour = date.getHours();
  let sec = date.getSeconds();

  if (hour >= 4 && hour < 12) {
    h2.textContent = `Good Morning, ${USERNAME}`;
  } else if (hour >= 12 && hour <= 16) {
    h2.textContent = `Good Afternoon, ${USERNAME}`;
  } else if (hour >= 16 || hour < 4) {
    h2.textContent = `Good Evening, ${USERNAME}`;
  }
}

setInterval(greet, 1000);

// MOdal show  function
function showModal() {
  const ele = document.querySelector(".header__modal");
  ele.style.cssText = "display:block";
}

function hideModal() {
  const ele = document.querySelector(".header__modal");
  ele.style.cssText = "display:none";
}

const img = document.querySelector(".header__icon");
img.addEventListener("click", (e) => {
  showModal();
});
